;========================================================
;			Глобальные константы
;========================================================

;------------------------- Адреса устройств

.equ	OUR_ADDR		= 0x11
.equ	SERVER_ADDR		= 0x10

;------------------------- Имена команд

.equ	CMD_PING				= 0x01
.equ	CMD_QUERY				= 0x02
.equ	CMD_CANCEL_QUERY		= 0x03
.equ	CMD_RESPONSE_TO_QUERY	= 0x04

;------------------------- Состояние регистра CONN_STATE (соединение)

.equ	DISCONNECTED			= 0x00
.equ	CONNECTED				= 0x01

;------------------------- Состояние регистра STATE

.equ	STATE_OK				= 0x00		; запросов нет				
.equ	STATE_WAITING_RESPONSE	= 0x01		; ожидается ответ нам		
.equ	STATE_WAITING_US		= 0x02		; ожидается ответ от нас	
.equ	STATE_RECEIVED_RESPONSE	= 0x03		; получен ответ				
.equ	STATE_ERROR				= 0x04		; ошибка					

;========================================================
;			Глобальные переменные в РОН
;========================================================

.def	CONST_ZERO		= r0				; Постоянный ноль
.def	SRC_ADDR		= r1				; Адрес отправителя.
.def	DST_ADDR		= r2				; Адрес получателя
.def	DATA			= r3				; Данные для получателя
.def	counter_CONN_STATE = r4				; Счетчик для сброса CONN_STATE. По умолчанию каждые 10 секунд.
.def	counter_BLINK_TIME = r5				; Счетчик для сброса режима мигания STATE_RECEIVED_RESPONSE.
.def	counter_PING	= r6				; Счетчик для отправки пинга. По умолчанию каждые 5 секунд.

.def	STATE			= r20				; Состояние запросов. Нет запросов == 0, ожидаем ответ == 1, ожидается ответ от нас == 2, получен ответ == 3, коллизия == 4
.def	CONN_STATE		= r21				; Состояние соединения. Соединение не установлено == 0, соединение установлено == 1
.def	BYTE			= r22				; Байт передачи\приёма данных 

;========================================================
;			Глобальные переменные в EEPROM
;========================================================

.eseg										; Выбираем сегмент EEPROM
	.org	0x00							; Устанавливаем текущий адрес сегмента

;------------------------- Хранение данных для будильника и яркости

;========================================================
;				Глобальные переменные в RAM
;========================================================

.dseg										; Выбираем сегмент RAM
	.org	0x60							; Устанавливаем текущий адрес сегмента

