;========================================================
;			Глобальные константы
;========================================================

.equ	LED_0			=	0x00
.equ	LED_1			=	0x01
.equ	LED_2			=	0x02
.equ	LED_3			=	0x03
.equ	LED_4			=	0x04

;========================================================
;			Глобальные переменные в РОН
;========================================================

.def	CONST_ZERO		= r0		; постоянный ноль
.def	USER_REG_STATUS	= r16		; пользовательский регистр статусов
;-------------------------------------------------
;|  7  |  6  |  5  |  4  |  3  |  2  |  1  |  0  |
;-------------------------------------------------
; бит 0 - ACK_NACK: 0 - ACK, 1 - NACK

.def	LED_0_cache		= r10
.def	LED_1_cache		= r11
.def	LED_2_cache		= r12
.def	LED_3_cache		= r13
.def	LED_4_cache		= r14

.def	ADDR			= r20
.def	LED				= r21
.def	COLOR			= r22

.def	BYTE			= r23		; Байт передачи\приём данных

;========================================================
;				Глобальные переменные в RAM
;========================================================

.dseg								; Выбираем сегмент RAM
	.org	0x60					; Устанавливаем текущий адрес сегмента

;------------------------- Хранение данных в упакованном формате от DS1302
